#include "medicineTestDB.h"

template <>
std::vector<medicine::Drug> ItemDBTestInterface<medicine::Drug>::list_ = {};
template <>
int ItemDBTestInterface<medicine::Drug>::code_ = 0;

MedicinesDBTest::MedicinesDBTest() {
    using namespace medicine;

    const ReleaseForm capsule = RELEASE_FORMS[5];
    const ReleaseForm powder = RELEASE_FORMS[9];
    const ReleaseForm suspension = RELEASE_FORMS[10];
    const ReleaseForm tablets = RELEASE_FORMS[12];

    const std::vector<Drug> medicines = {
            Drug("", "Напроксен", "Naproxenum", true,
                 {tablets},
                 {"Aльгезир Ультра", "Мотрин", "Налгезин",
                  "Напроксен", "Пенталгин моно", "Тералив 275"},
                 {},
                 "Повышенная чувствительность к напроксену, бронхиальная астма,\
            крапивница или аллергические реакции после приема ацетисалициловой кислоты или других НПВС,\
            периоперационная боль в условиях операции аортокоронарного шунтирования.",
                 125),
            Drug("", "Парацетамол", "Paracetamolum ", false,
                 {tablets, suspension},
                 {"Апап", "Апотель", "Детский панадол", "Ифимол",
                  "Ксумапар", "Панадол", "Парацетамол", "Цефекон"},
                 {"от 12 лет - 0.5 - 1г 4 раза в сутки, курс 5-7  дней",
                  "6–12 лет — 240–480 мг", "1–6 лет — 120–240 мг",
                  "от 3 мес до 1 года — 24–120 мг до 4 раз в сутки в течение 3 дней"},
                 "Гиперчувствительность, нарушение функций почек и печени, \
            алкоголизм, детский возраст (до 6 лет).",
                 25),
            Drug("Мирамистин",
                 "Бензилдиметил[3-(миристоиламино)пропил]аммоний хлорид моногидрат",
                 "Benzyldimethyl[3-myristoilamine)-propyl]ammonium chloridi monohydratum",
                 false,
                 {suspension},
                 {"Мирамистин"},
                 {},
                 "Повышенная чувствительность к действующему веществу. \
            Не рекомендуется применение препарата в форме спрея \
            для орошения горла и миндалин у детей до 3 лет ввиду \
            риска реактивного ларингоспазма.",
                 200),
            Drug("Кардиомагнил ",
                 "Ацетилсалициловая кислота + Магния гидроксид",
                 "Acidum acetylsalicylicum + Magnesii hydroxydum",
                 false,
                 {tablets},
                 {"Ацетилсалициловая кислота + Магния гидроксид,"
                  "Кардевит", "ТромбоМАГ", "Кардиомагнил", "Магникардил"},
                 {},
                 "Повышенная чувствительность к ацетилсалициловой кислоте и другим НПВПС; \
            кровоизлияние в головной мозг; \
            склонность к кровотечению \
            (недостаточность витамина К, тромбоцитопения, геморрагический диатез); \
            эрозивно-язвенное поражение ЖКТ (в фазе обострения); \
            желудочно-кишечное кровотечение; \
            бронхиальная астма, индуцированная приемом салицилатов и других НПВС; \
            полное или неполное сочетание бронхиальной астмы, \
            рецидивирующего полипоза носа и околоносовых пазух \
            с непереносимостью ацетилсалициловой кислоты \
            или других НПВС, включая ингибиторы ЦОГ-2 (в т.ч. в анамнезе); \
            одновременный прием метотрексата в дозе 15 мг/нед и более; \
            тяжелая почечная недостаточность (Cl креатинина <30 мл/мин); \
            тяжелая печеночная недостаточность (класс В и С по шкале Чайлд-Пью); \
            хроническая сердечная недостаточность III и IV функционального класса по классификации NYHA; \
            беременность (I и III триместры); кормление грудью; возраст до 18 лет.",
                 80),
            Drug("Арбидол", "Умифеновир", "Umifenovirum ", false,
                 {tablets, capsule, powder},
                 {"Арбидол", "Арбидол Максимум", "Аперфлю",
                  "Алюдол", "Умифеновир"},
                 {"от 6 до 12 лет — 20 мл (100 мг)",
                  "старше 12 лет и взрослым — 40 мл (200 мг) 1 раз в день в течение 12–14 дней"},
                 "Повышенная чувствительность к умифеновиру; \
            детский возраст до 2–12 лет в зависимости от показания и лекарственной формы.",
                 200),
            };

    for (auto drug : medicines)
        add(drug);
}
